# Question 1. 


Make an API request that returns the months where "fire" was searched in 2016. Which month had the most searches?

Step 1: Find open data set

Step 2: Find data catalog

Step 3: Find endpoint

 for top 500 monthly searches, copied API endpoint is: https://data.nashville.gov/resource/fuaa-r5cm.json

In [73]:
import requests
import matplotlib.pyplot as plt

In [4]:
endpoint = 'https://data.nashville.gov/resource/fuaa-r5cm.json'

In [58]:
# endpoint with parameters
endpoint_three = 'https://data.nashville.gov/resource/fuaa-r5cm.json?year=2016&query_text=fire'

In [60]:
response_three = requests.get(endpoint_three)

response_three.text

'[{"month_name":"January","year":"2016","query_count":"19","query_text":"fire"}\n,{"month_name":"February","year":"2016","query_count":"35","query_text":"fire"}\n,{"month_name":"March","year":"2016","query_count":"32","query_text":"fire"}\n,{"month_name":"April","year":"2016","query_count":"26","query_text":"fire"}\n,{"month_name":"May","year":"2016","query_count":"24","query_text":"fire"}\n,{"month_name":"June","year":"2016","query_count":"31","query_text":"fire"}\n,{"month_name":"July","year":"2016","query_count":"24","query_text":"fire"}\n,{"month_name":"August","year":"2016","query_count":"47","query_text":"fire"}\n,{"month_name":"September","year":"2016","query_count":"36","query_text":"fire"}\n,{"month_name":"October","year":"2016","query_count":"38","query_text":"fire"}\n,{"month_name":"November","year":"2016","query_count":"32","query_text":"fire"}\n,{"month_name":"December","year":"2016","query_count":"38","query_text":"fire"}]\n'

In [68]:
json_response =response_three.json()

In [71]:
new_dict = pd.DataFrame.from_dict(json_response)

new_dict

   month_name  year query_count query_text
0     January  2016          19       fire
1    February  2016          35       fire
2       March  2016          32       fire
3       April  2016          26       fire
4         May  2016          24       fire
5        June  2016          31       fire
6        July  2016          24       fire
7      August  2016          47       fire
8   September  2016          36       fire
9     October  2016          38       fire
10   November  2016          32       fire
11   December  2016          38       fire

In [72]:
new_dict_one = pd.DataFrame.from_dict(res)
new_dict_one

    month_name  year query_count               query_text
0      January  2014         223                     ebid
1      January  2014         112            property maps
2      January  2014          97                     maps
3      January  2014          90             property tax
4      January  2014          76                     jobs
..         ...   ...         ...                      ...
995   February  2014           7                pay stubs
996   February  2014           7        school lunch menu
997   February  2014           7  contractors permit bond
998   February  2014           7                    media
999   February  2014           7                 pay plan

[1000 rows x 4 columns]

    month_name  year query_count               query_text
0      January  2014         223                     ebid
1      January  2014         112            property maps
2      January  2014          97                     maps
3      January  2014          90             property tax
4      January  2014          76                     jobs
..         ...   ...         ...                      ...
995   February  2014           7                pay stubs
996   February  2014           7        school lunch menu
997   February  2014           7  contractors permit bond
998   February  2014           7                    media
999   February  2014           7                 pay plan

[1000 rows x 4 columns]

In [ ]:
url = 'https://data.nashville.gov/'

# link for SODA API documentation: https://dev.socrata.com/consumers/getting-started.html